_My notebook on_
# Python for Data Analysis - Wes McKinney
## Chapter 5 - Getting Started with pandas
### Part 1 - Introduction to pandas Data Structures

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4, 7, -5, 3])
# sort of dictionary, index -> value
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# series index: RangeIndex object, kind of plain python range
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
# series values: numpy array
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
# labeled Series:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
# here index can't be a range, it's a Index instead
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
print(obj2['a'], obj2['d'])
obj2['d'] = 6
print(obj2['a'], obj2['d'])
print(obj2[['c', 'a', 'd']])

-5 4
-5 6
c    3
a   -5
d    6
dtype: int64

In [8]:
# numpy functions and operations on Series work on values and preserve the index:
print(obj2[obj2 > 0])
print('---')
print(obj2 * 2)
print('---')
print(np.exp(obj2))

d    6
b    7
c    3
dtype: int64
---
d    12
b    14
a   -10
c     6
dtype: int64
---
d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [9]:
# series as dictionary
print('b' in obj2, 'e' in obj2)

True False

In [10]:
# from python dictionary to Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [11]:
# rearranging items in dictionary to follow a given index
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
print(obj4)
# Utah dropped being out of index, California NaN being not in dictionary
print(pd.isnull(obj4))
print(pd.isnull(obj4)['California'], pd.isna(obj4)[0], obj4.isnull()['Ohio'], obj4.isna()[1])
print(pd.notnull(obj4)['California'], pd.notna(obj4)[0], obj4.notnull()['Ohio'], obj4.notna()[1])

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
True True False False
False False True True

In [12]:
# automatic aligment for arithmetic operations
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [13]:
# Series has an optional name, as its index
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [14]:
# change index inplace
x = obj.index
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
print(x, obj.index)
obj.index = x

RangeIndex(start=0, stop=4, step=1) Index(['Bob', 'Steve', 'Jeff', 'Ryan'], dtype='object')

# DataFrame

In [15]:
# from dict of lists (or numpy arrays)

data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

# column by alphabetical order
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [16]:
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [17]:
frame.head(2)

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001

In [18]:
frame.tail(2)

   pop   state  year
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [19]:
# forcing column order - name not found leads to missing values in column
# setting index names
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['1', '2', 'a', 'k', 'xy', 'z'])
frame2

    year   state  pop debt
1   2000    Ohio  1.5  NaN
2   2001    Ohio  1.7  NaN
a   2002    Ohio  3.6  NaN
k   2001  Nevada  2.4  NaN
xy  2002  Nevada  2.9  NaN
z   2003  Nevada  3.2  NaN

In [20]:
print(frame2.columns, frame2.index)

Index(['year', 'state', 'pop', 'debt'], dtype='object') Index(['1', '2', 'a', 'k', 'xy', 'z'], dtype='object')

In [21]:
# column as dataframe attribute
frame2.state

1       Ohio
2       Ohio
a       Ohio
k     Nevada
xy    Nevada
z     Nevada
Name: state, dtype: object

In [22]:
# column as sort of value in a sort of dictionary
frame2['pop']

1     1.5
2     1.7
a     3.6
k     2.4
xy    2.9
z     3.2
Name: pop, dtype: float64

In [23]:
# row by loc
frame2.loc['xy']

year       2002
state    Nevada
pop         2.9
debt        NaN
Name: xy, dtype: object

In [24]:
# assign scalar to column
frame2['debt'] = 16.5
frame2

    year   state  pop  debt
1   2000    Ohio  1.5  16.5
2   2001    Ohio  1.7  16.5
a   2002    Ohio  3.6  16.5
k   2001  Nevada  2.4  16.5
xy  2002  Nevada  2.9  16.5
z   2003  Nevada  3.2  16.5

In [25]:
# assign range to column
frame2['debt'] = range(6)
frame2

    year   state  pop  debt
1   2000    Ohio  1.5     0
2   2001    Ohio  1.7     1
a   2002    Ohio  3.6     2
k   2001  Nevada  2.4     3
xy  2002  Nevada  2.9     4
z   2003  Nevada  3.2     5

In [26]:
# assing Series to column, uses index:
val = pd.Series([-1.2, -1.5, -1.7], index=['a', 'xy', 'z'])
frame2['debt'] = val
frame2

    year   state  pop  debt
1   2000    Ohio  1.5   NaN
2   2001    Ohio  1.7   NaN
a   2002    Ohio  3.6  -1.2
k   2001  Nevada  2.4   NaN
xy  2002  Nevada  2.9  -1.5
z   2003  Nevada  3.2  -1.7

In [27]:
# create a column by assignment
frame2['eastern'] = frame2.state == 'Ohio'
frame2

    year   state  pop  debt  eastern
1   2000    Ohio  1.5   NaN     True
2   2001    Ohio  1.7   NaN     True
a   2002    Ohio  3.6  -1.2     True
k   2001  Nevada  2.4   NaN    False
xy  2002  Nevada  2.9  -1.5    False
z   2003  Nevada  3.2  -1.7    False

In [28]:
# remove column by del
del frame2['eastern']
frame2

    year   state  pop  debt
1   2000    Ohio  1.5   NaN
2   2001    Ohio  1.7   NaN
a   2002    Ohio  3.6  -1.2
k   2001  Nevada  2.4   NaN
xy  2002  Nevada  2.9  -1.5
z   2003  Nevada  3.2  -1.7

In [29]:
# nested dict of dict
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [30]:
# transpose dataframe
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [31]:
print(frame3['Ohio'][:-1])
print(frame3['Nevada'][:2])

2000    1.5
2001    1.7
Name: Ohio, dtype: float64
2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [32]:
print(frame3['Nevada'])
print(frame3['Nevada'][:-1])

2000    NaN
2001    2.4
2002    2.9
Name: Nevada, dtype: float64
2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [33]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [34]:
# optional name for index and columns
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [35]:
# extract data as ndarray
print(frame3.values, frame3.values.dtype)
print(frame2.values, frame2.values.dtype)

[[nan 1.5]
 [2.4 1.7]
 [2.9 3.6]] float64
[[2000 'Ohio' 1.5 nan]
 [2001 'Ohio' 1.7 nan]
 [2002 'Ohio' 3.6 -1.2]
 [2001 'Nevada' 2.4 nan]
 [2002 'Nevada' 2.9 -1.5]
 [2003 'Nevada' 3.2 -1.7]] object

In [36]:
# indices are immutable

obj = pd.Series(range(3), index=['a', 'b', 'c'])
print(obj.index)
print(obj.index[1:])

try:
    obj.index[1] = 'x'
except TypeError as te:
    print("As expected, TypeError:", te)

# they behave as set for checking ownership
print('a' in obj.index, 'x' in obj.index)

Index(['a', 'b', 'c'], dtype='object')
Index(['b', 'c'], dtype='object')
As expected, TypeError: Index does not support mutable operations
True False